"""
Задача 14:
Требуется вывести все целые степени двойки 
(т.е. числа вида 2 k ), не превосходящие числа N

10 -> 1 2 4 8
"""

n = int(input("Введите число: "))
while n <= 0:
    n = int(input("Введите натуральное число: "))

i = 0
num = 1
while num <= n:
    num = 2**i
    print(num, end=" ")
    i += 1
    